

getOut = False
# === функция чтения файла ===========================================
def readFile(fName):
    print()
    # пока пусто

# === функция сохранения файла ===========================================
def saveFile(fName):
    print()
    # пока пусто

# === функция поиска абонента ===========================================
def findAbon(findArg):
    print()
    # пока пусто

# === функция поиска абонента ===========================================
def mainMenu():
    getOut=False

    while getOut:
        print()
        print('=========================================================')
        print('Выберите пункт меню, нажав соответствующую цифру и Enter.')
        print('1. Открыть файл')
        print('2. Добавить абонента')
        print('3. Удалить абонента')
        print('4. Найти абонента')
        print('5. Редактировать запись')
        print('Q/q. выйти из программы')
        print()
        choice = input('Ваш выбор: ')
        if choice == 'Q' or 'q': getOut=True
        # пока пусто

def main():
    mainMenu()

mainMenu() # старт программы -------------------------------------------------------------------
